/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hshimoma <hshimoma@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/11/11 18:52:51 by hshimoma          #+#    #+#             */
/*   Updated: 2024/11/11 21:52:30 by hshimoma         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//数字であるかの文字テスト

#include "libft.h"

int	ft_isdigit(int c)
{
	return (c >= '0' && c <= '9');
}

// #include <stdio.h>

// int main(void)
// {
//     char c;

//     c = '0';
//     if (ft_isdigit(c))
//     {
//         printf("%c は真である\n",c);
//     }
//     else
//     {
//         printf("%c は偽である\n",c);
//     }
//     return (0);
// }