/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hshimoma <hshimoma@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/11/11 19:10:14 by hshimoma          #+#    #+#             */
/*   Updated: 2024/11/17 17:10:23 by hshimoma         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//指定されてファイルディスクリプタに１文字出力

#include "libft.h"

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
