/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   validation.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hshimoma <hshimoma@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/04/18 18:08:15 by hshimoma          #+#    #+#             */
/*   Updated: 2025/04/19 00:15:56 by hshimoma         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

//渡された文字列配列strsのすべての文字列が数字だけでできているかをチェック
//１．２次元配列strsを１行ずつループ(i)　２．各行の中から１文字ずつをループ(j)
//３．その文字が'0'-'9'の範囲外ならreturn(0)　４．最後までOKならreturn (1)
int	all_num(char **strs)
{
	int	i;
	int	j;

	i = 0;
	while (strs[i] != NULL)
	{
		j = 0;
		while (strs[i][j] != '\0')
		{
			if (strs[i][j] < '0' || strs[i][j] > '9')
				return (0);
			j++;
		}
		i++;
	}
	return (1);
}
//todo
//符号（+,-）に対応していない-42がくると0が返る